SELECT count(*) from Hourses -- لارجاع عدد الخيول

----------------------- لارجاع قائمه الخيول وتفاصيلها من الاجدد الى الاقدم------------------------------
SELECT * FROM Hourses h INNER JOIN HourseMealTypes hmt ON h.MealType = hmt.Id INNER JOIN HourseNeededs hn ON h.HourseNeeded = hn.Id ORDER BY h.Id DESC
 -- --------------------------------------------------------------

----------------------لارجاع تفاصيل خيل بشرط عدد الوجبات تساوي اثنتين---------------------------------
SELECT * from Hourses h WHERE h.MealCount=2
---------------------------------------------------
-----------------------------------لارجاع عدد وجبات الخيول في اليوم-----------------------

SELECT SUM(h.MealCount) FROM Hourses h
------------------------------------------ارجاع قائمه الخيل التي تحتاج وجبتين وجنسها ذكر---------------------
SELECT * FROM Hourses h WHERE h.MealCount > 2 AND h.HourseGender LIKE 'Male'








----------------------------------------------------ارجاع قائمه المشتركين الذين اسم الاول لهم محمد والاسم الثاني  تيست من الاقدم الى الاحد ------------------------------------------------------
select * FROM Members m WHERE m.FirstName LIKE 'mohmmad' AND m.LastName LIKE 'test' ORDER BY m.Id ASC
-------------------------------------------ارجاع قائمه المشتركين ونوع الاشتراك الخاص بهم--------------------------------------------------------------------
select * from Members m INNER join MemberTypes mt ON m.MemberType = mt.Id
--------------------------------------------ارجاع عدد المشتركين-------------------------------------------------------
select COUNT(*) FROM Members m 
-----------------------------------------------------ارجاع الاشتراكات التي نوعها 1 و 2 و 3------------------------------------------------------
select * from Members m INNER JOIN MemberTypes mt ON m.MemberType = mt.Id WHERE mt.Id IN (1,2,3)



---------------------------------------ارجاع قائمه اصحاب الشركه-----------------------------------------
select * FROM Employees e WHERE e.duty LIKE 'company owner'
------------------------------------------------ارجاع كل الموظفين الذين قد قاموا بتعبئه الاسم الاول والاخير--------------------------------------------------
select * FROM Employees e WHERE e.FirstName IS NOT NULL and e.LastName IS NOT NULL
--------------------------------------ارجاع الموظفين التي يجتوي الاسم الاول او الاخير على محمد-------------------------------------------
select * FROM Employees e WHERE e.FirstName like'mohmmad' or e.LastName LIKE 'mohmmad'
----------------------------------------------------ارجاع عدد الموظفين-------------------------------------------------------------------------
select COUNT(*) FROM employee
--------------------------------------------------------ارجاع اقدم الموظفين-----------------------------
SELECT MIN(id) FROM Employees e 
---------------------------------------------------------------ارجاع الموظفين الذين يوم عطلتهم السبت-----------------------------------------
SELECT * FROM Employees e WHERE e.Saturday=0
-----------------------------------------------------------ارجاع الموظفين الذين يداومون طوال الاسبوع ما عدا الجمعه والسبت---------------------------------------------------------------------
select * from Employees e WHERE e.Sunday=1 AND e.Monday=1 AND e.Tuesday=1 AND e.Wednesday=1 AND e.Thursday=1 and e.Friday=0 AND e.Saturday=0